# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# QUAN-YOLO11: Quaternion Approximation Networks for Object Detection
# Uses quaternion convolutions throughout for rotation-equivariant features
# Paper: "QUAN: Rotation-Equivariant Object Detection via Separable Quaternion Neural Networks"

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-quan.yaml' will call yolo11-quan.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # QUAN-YOLO11n
  s: [0.50, 0.50, 1024] # QUAN-YOLO11s
  m: [0.50, 1.00, 512]  # QUAN-YOLO11m
  l: [1.00, 1.00, 512]  # QUAN-YOLO11l
  x: [1.00, 1.50, 512]  # QUAN-YOLO11x

# QUAN-YOLO11 backbone with quaternion modules
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2  (uses QConv2D internally)
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, QSPPF, [1024, 5]]      # 9 - Quaternion Spatial Pyramid Pooling
  - [-1, 2, QC2PSA, [1024]]        # 10 - Quaternion C2 with Position-Sensitive Attention

# QUAN-YOLO11 head with quaternion upsampling
head:
  - [-1, 1, QUpsample, [2, "nearest"]]  # 11 - Quaternion-aware upsampling
  - [[-1, 6], 1, Concat, [1]]           # 12 - cat backbone P4
  - [-1, 2, C3k2, [512, False]]         # 13

  - [-1, 1, QUpsample, [2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]           # 15 - cat backbone P3
  - [-1, 2, C3k2, [256, False]]         # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]          # 17
  - [[-1, 13], 1, Concat, [1]]          # 18 - cat head P4
  - [-1, 2, C3k2, [512, False]]         # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]          # 20
  - [[-1, 10], 1, Concat, [1]]          # 21 - cat head P5
  - [-1, 2, C3k2, [1024, True]]         # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]     # 23 - Detect(P3, P4, P5) with QER extraction
